{
    "data": [
        {
            "edit_history_tweet_ids": [
                "1663959198156062727"
            ],
            "id": "1663959198156062727",
            "text": "Tech Talk Guru Craig Peterson breaks down more barriers to a bright future of next generation nuclear power. https://t.co/nEg4rVBgHJ"
        },
        {
            "edit_history_tweet_ids": [
                "1663959177247735808"
            ],
            "id": "1663959177247735808",
            "text": "RT @JayinKyiv: The exact narrative you'd expect Russia to put out if they were about to blow up a Ukrainian nuclear power plant to then bla…"
        },
        {
            "edit_history_tweet_ids": [
                "1663959149237895183"
            ],
            "id": "1663959149237895183",
            "text": "Remember when Biden and the demonrats shut down pipelines, drilling, exploration, coal ,gas and nuclear power plants ? They're setting up the infrastructure for failure and planning to blame conservatives when they shut it 📴"
        },
        {
            "edit_history_tweet_ids": [
                "1663959054828580864"
            ],
            "id": "1663959054828580864",
            "text": "#Constitution Can anyone explain how it's constitutional for the president to have a nuclear button?\n\nThe power supposedly resides with Congress. If they want to move it to the executive branch they need to have specific rules where the president is simply a last check."
        },
        {
            "edit_history_tweet_ids": [
                "1663959041012269065"
            ],
            "id": "1663959041012269065",
            "text": "@DaveyBiden2024 @Socialistdemmo Use the open land to make thousands of nuclear power plants"
        },
        {
            "edit_history_tweet_ids": [
                "1663958958682394624"
            ],
            "id": "1663958958682394624",
            "text": "🇷🇺 Rosatom offers 🇮🇳 India small-sized nuclear power plant (SNPP) project   \n\n🔋Russia’s nuclear energy corporation plans to submit a preliminary design for such a plant by the end of this year, the company said.\n\nSubscribe to @sputniknewsindia https://t.co/sqnMtYOfJs"
        },
        {
            "edit_history_tweet_ids": [
                "1663958913035931653"
            ],
            "id": "1663958913035931653",
            "text": "RT @MonicaM444: Employees of the ZNPP have been abused long enough. Some that were ex military of 🇺🇦, or that showed a Pro-Ukrainian stance…"
        },
        {
            "edit_history_tweet_ids": [
                "1663958902138863646"
            ],
            "id": "1663958902138863646",
            "text": "RT @JayinKyiv: Russian state media just put out the exact narrative you'd expect them to put out if they were going to blow up a nuclear po…"
        },
        {
            "edit_history_tweet_ids": [
                "1663953132626526208",
                "1663958844052242433"
            ],
            "id": "1663958844052242433",
            "text": "Just learned about nuclear Stirling generators this week.\n\nAnd I must say, the prospect of unlimited power has never been more cool. https://t.co/eqvcrOqazi https://t.co/2xSTaPGtvW"
        },
        {
            "edit_history_tweet_ids": [
                "1663958796677570561"
            ],
            "id": "1663958796677570561",
            "text": "RT @Prolotario1: Cyber Attack \n\nPower Grid \n\nMass Shootings\n\nVirus\n\nNuclear Attack \n\nBorder Invasion \n\nUFO Invasion \n\nI told you all they w…"
        },
        {
            "edit_history_tweet_ids": [
                "1663966848747192326"
            ],
            "id": "1663966848747192326",
            "text": "@MriyaReport Hun Sen is threatening Asian countries that Cambodia is also producing nuclear energy, he has announced three times. https://t.co/ZE0qe86Z8T"
        },
        {
            "edit_history_tweet_ids": [
                "1663966765225787403"
            ],
            "id": "1663966765225787403",
            "text": "@tonyannett You might want to double-check what you cite. Austria  gets 65% of their power from hydro (https://t.co/C2r6WaSbsI). Sweden as I said in our dialogue gets 74% from hydro/nuclear. The majority of Portugal's energy relies on coal, gas, and hydro. There's a transition, not rapid."
        },
        {
            "edit_history_tweet_ids": [
                "1663966481564987393"
            ],
            "id": "1663966481564987393",
            "text": "@RachelReevesMP @rodrikdani @GeorgeDibb Low density renewable energy is sufficient for domestic electricity but we would require a fleet of nuclear power stations if we want to sufficiently power commercial electricity."
        },
        {
            "edit_history_tweet_ids": [
                "1663966219400036364"
            ],
            "id": "1663966219400036364",
            "text": "@mikoske This is why we need industrial scale energy storage solutions.\nLowering nuclear output is very sub-optimal way of solving the energy flood."
        },
        {
            "edit_history_tweet_ids": [
                "1663966162185584640"
            ],
            "id": "1663966162185584640",
            "text": "Jared Huffman (D-CA), who is going to vote against the debt ceiling bill because of one pipeline in West Virginia, in 2014 offered an amendment to reduce funding for nuclear energy research. \nhttps://t.co/S2VVa2zmPn https://t.co/TLMeo5lxmf https://t.co/GUBtJnpPYC"
        },
        {
            "edit_history_tweet_ids": [
                "1663966097614295041"
            ],
            "id": "1663966097614295041",
            "text": "RT @MikeHudema: France is requiring all 80 stall+ parking lots – both existing and new – to be covered by solar panels. That would add 10 n…"
        },
        {
            "edit_history_tweet_ids": [
                "1663965964663242752"
            ],
            "id": "1663965964663242752",
            "text": "@Cornish_Rebel @ox_anna29 Plus they never factor in decommissioning in the costing let future generations worry about that ? We are best placed in EU for renewable energy the severn estuary tidal lagoon project for example Tidal systems could be huge with similar level of investment to Nuclear"
        },
        {
            "edit_history_tweet_ids": [
                "1663965884891668481"
            ],
            "id": "1663965884891668481",
            "text": "RT @Marian_L_Tupy: Finnish electricity price drops BELOW ZERO after the latest nuclear reactor is switched on.\n\nThat is what the world coul…"
        },
        {
            "edit_history_tweet_ids": [
                "1663965455596257280"
            ],
            "id": "1663965455596257280",
            "text": "@2closetocall That’s at least one  full scale nuclear plant or multiple modular plants that could have been built to improve our energy grid. Volpe is doing amazing job chasing his lobby checks with bs math. Best part this plant was going to be built ex subsidies until VW."
        },
        {
            "edit_history_tweet_ids": [
                "1663965451448139783"
            ],
            "id": "1663965451448139783",
            "text": "RT @johncarlbaker: \"It is shocking that the Energy Department, without even notifying the public, would undermine a decades-old, bipartisan…"
        }
    ]
}
